python/throught_aware_router_demo/2025-03-28_21-03-22/pow_2/experiment_1/benchmark.log
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, dataset_name='sharegpt', dataset_path='./LARGER_GAP_short_80_long_20_sharegpt_requests.json', model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, num_prompts=1024, sharegpt_output_len=100, random_input_len=None, random_output_len=None, random_range_ratio=0.0, request_rate=inf, seed=1, multi=False, request_rate_range='2,34,2', output_file=None, disable_tqdm=False, disable_stream=False, disable_ignore_eos=False, extra_request_body=None, max_concurrency=64, gen_num_groups=64, gen_prompts_per_group=16, gen_system_prompt_len=2048, gen_question_len=128, gen_output_len=256)

Total number of conversations: 10925
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
100%|██████████| 1024/1024 [05:01<00:00,  3.39it/s]

============ Serving Benchmark Result ============
Backend:                                 vllm      
Traffic request rate:                    inf       
Successful requests:                     1023      
Long requests:                           136       
Short requests:                          887       
Benchmark duration (s):                  301.78    
Total input tokens:                      540979    
Total generated tokens:                  520300    
Total generated tokens (retokenized):    520119    
Request throughput (req/s):              3.39      
Input token throughput (tok/s):          1792.66   
Output token throughput (tok/s):         1724.13   
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17256.06  
Median E2E Latency (ms):                 3757.09   
P95 E2E Latency (ms):                    70052.90  
P99 E2E Latency (ms):                    72941.30  
Long requests Mean E2E Latency (ms):     67133.84822652204
Short requests Mean E2E Latency (ms):    9608.508899875986
Long requests Median E2E Latency (ms):   68322.24020600006
Short requests Median E2E Latency (ms):  3660.347403999822
Long requests P95 E2E Latency (ms):      73021.63499674998
Short requests P95 E2E Latency (ms):     67306.65292479993
Long requests P99 E2E Latency (ms):      73654.44105464983
Short requests P99 E2E Latency (ms):     71315.05792143989
---------------Time to First Token----------------
Mean TTFT (ms):                          508.97    
Median TTFT (ms):                        351.14    
P95 TTFT (ms):                           1319.89   
P99 TTFT (ms):                           2966.25   
Long Requests Mean TTFT (ms):            727.63    
Short Requests Mean TTFT (ms):           475.44    
Long Requests Median TTFT (ms):          610.00    
Short Requests Median TTFT (ms):         301.21    
Long Requests P95 TTFT (ms):             1405.14   
Short Requests P95 TTFT (ms):            1316.07   
Long Requests P99 TTFT (ms):             2785.79   
Short Requests P99 TTFT (ms):            2962.85   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.00     
Median TPOT (ms):                        33.04     
P99 TPOT (ms):                           40.15     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.10     
Median ITL (ms):                         42.93     
P99 ITL (ms):                            168.81    
==================================================